Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainNonSeqIntersWithDivLines Property
 The chain formed by these curve elements has multiple non-sequential intersections with the same gridline and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainNonSeqIntersWithDivLines { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainNonSeqIntersWithDivLines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainNonSeqIntersWithDivLines {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainNonSeqIntersWithDivLines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace